# Pandas Cheat Sheet

In [1]:
import pandas as pd

## Creating DataFrames

### From Scratch

In [2]:
# dictionary of lists
employees = pd.DataFrame({
    'id': [1, 2, 3, 4, 5],
    'name': ['Alice', 'Bob', 'Charlie', 'David', 'Eve'],
    'age': [25, 30, 35, 40, 22],
    'salary': [50000, 60000, 70000, 80000, 45000],
    'department': ['HR', 'IT', 'Finance', 'IT', 'HR']
})

display(employees)

   id     name  age  salary department
0   1    Alice   25   50000         HR
1   2      Bob   30   60000         IT
2   3  Charlie   35   70000    Finance
3   4    David   40   80000         IT
4   5      Eve   22   45000         HR

In [3]:
# list of lists + columns
experience = pd.DataFrame([
    [1, 2],
    [2, 5],
    [3, 7],
    [4, 10],
    [5, 1]
], columns=['id', 'years_of_experience'])

display(experience)

   id  years_of_experience
0   1                    2
1   2                    5
2   3                    7
3   4                   10
4   5                    1

### From a CSV

In [4]:
attendance = pd.read_csv(r'./data/attendance.csv') #for excel, sub csv to excel
attendance.info() # great way to investigate a dataframe

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 45 entries, 0 to 44
Data columns (total 4 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   employee_id     45 non-null     int64
 1   date            45 non-null     object
 2   clock_in_time   45 non-null     object
 3   clock_out_time  45 non-null     object
dtypes: int64(1), object(3)
memory usage: 1.5+ KB

### From a JSON

In [ ]:
import json

# Read JSON into memory as a list of dictionaries
with open(r'./data/addresses.json', 'r') as file:
    data = json.load(file)

print(type(data))
print("First element:", data[0]) #Print first element

<class 'list'>
First element: {'id': 1, 'address': {'street': '123 Maple St', 'city': 'Springfield', 'state': 'IL', 'zip_code': '62704', 'country': 'USA'}}

In [6]:
addresses = pd.DataFrame(data) #Convert to DataFrame
display(addresses)

   id                                            address
0   1  {'street': '123 Maple St', 'city': 'Springfiel...
1   2  {'street': '456 Oak Ave', 'city': 'Austin', 's...
2   3  {'street': '789 Pine Rd', 'city': 'Columbus', ...
3   4  {'street': '101 Birch Blvd', 'city': 'Denver',...
4   5  {'street': '202 Cedar Ln', 'city': 'Seattle', ...

In [7]:
addresses = pd.json_normalize(data) #flatten nested json into rows
display(addresses)

,id,address.street,address.city,address.state,address.zip_code,address.country
0,1,123 Maple St,Springfield,IL,62704,USA
1,2,456 Oak Ave,Austin,TX,73301,USA
2,3,789 Pine Rd,Columbus,OH,43215,USA
3,4,101 Birch Blvd,Denver,CO,80202,USA
4,5,202 Cedar Ln,Seattle,WA,98101,USA

In [8]:
addresses.rename(
    columns={'address.street':'street', 'address.city':'city', 'address.state':'state', 'address.zip_code':'zip_code','address.country':'country'}, 
    inplace=True) #rename column headers inplace
display(addresses)

   id          street         city state zip_code country
0   1    123 Maple St  Springfield    IL    62704     USA
1   2     456 Oak Ave       Austin    TX    73301     USA
2   3     789 Pine Rd     Columbus    OH    43215     USA
3   4  101 Birch Blvd       Denver    CO    80202     USA
4   5    202 Cedar Ln      Seattle    WA    98101     USA

___

## Basic Querying with iloc and loc

### iloc: integer-based indexing 
 `df.iloc[row_index, column_index]`
- row_index: Integer(s) representing row position(s)
- column_index: Integer(s) representing column position(s)
- if only 1 value passsed, assumed as a row

| Usage                                      | Example                          |
|--------------------------------------------|----------------------------------|
| Select a single row                        | `employees.iloc[2]`              |
| Select multiple rows                       | `employees.iloc[[0, 2]]`         |
| Select a row range                         | `employees.iloc[1:3]`            |
| Select a single column                     | `employees.iloc[:, 1]`           |
| Select multiple columns                    | `employees.iloc[:, [0, 2]]`      |
| Select a row & column                      | `employees.iloc[0, 1]`           |
| Select row & column ranges                 | `employees.iloc[1:3, 0:2]`       |
| Select the last row                        | `employees.iloc[-1]`             |
| Select last 3 rows & last 2 columns        | `employees.iloc[-3:, -2:]`       |
| Assign a value                             | `employees.iloc[0, 1] = "Updated"` |

In [ ]:
employees.iloc[0] #Return first row of data - assumes all columns if not specified

id                1
name          Alice
age              25
salary        50000
department       HR
Name: 0, dtype: object

In [ ]:
employees.iloc[[0]] #Notice how the extra [] returns as a dataframe

   id   name  age  salary department
0   1  Alice   25   50000         HR

In [11]:
employees.iloc[:, [3]] # Returns all rows from the 4th column - the extra [] is only needed on columns

   salary
0   50000
1   60000
2   70000
3   80000
4   45000

In [13]:
employees.iloc[:, [0, 2]] # Returns all rows for columns 1 and 3

   id  age
0   1   25
1   2   30
2   3   35
3   4   40
4   5   22

In [12]:
employees.iloc[3,3] # Returns the value at the 4th row and 4th column

80000

In [14]:
employees.iloc[3,3] = 90000 # Change the value at the 4th row and 4th column to 90000
employees.iloc[3,3] # Check the value has changed

90000

### loc: label-based indexing
`df.loc[row_label, column_label]`
- row_label: Row index labels (can be values or conditions)
- column_label: Column names
- if only 1 value passed, assumes it's a row

| Usage                                      | Example                          |
|--------------------------------------------|----------------------------------|
| Select a single row                        | `employees.loc[2]`               |
| Select multiple rows                       | `employees.loc[[0, 2]]`          |
| Select a row range                         | `employees.loc[1:3]`             |
| Select a single column                     | `employees.loc[:, 'ColumnName']` |
| Select multiple columns                    | `employees.loc[:, ['Col1', 'Col2']]` |
| Select a row & column                      | `employees.loc[0, 'ColumnName']` |
| Select row & column ranges                 | `employees.loc[1:3, 'Col1':'Col2']` |
| Select the last row                        | `employees.loc[df.index[-1]]`    |
| Select last 3 rows & last 2 columns        | `employees.loc[df.index[-3:], df.columns[-2:]]` |
| Assign a value                             | `employees.loc[0, 'ColumnName'] = "Updated"` |

In [15]:
employees.loc[:,['id','name']] # return all rows from employee df for id and name columns

   id     name
0   1    Alice
1   2      Bob
2   3  Charlie
3   4    David
4   5      Eve

In [16]:
employees.loc[employees['department'] == 'IT', :] # return all columns for employees in the IT department

   id   name  age  salary department
1   2    Bob   30   60000         IT
3   4  David   40   90000         IT

In [17]:
employees.loc[employees['salary'] > 60000, ['name']] # return the names of each employee who has a salary more than 60000

      name
2  Charlie
3    David

In [18]:
employees.loc[(employees['department'] == 'IT') & (employees['salary'] > 60000), ['name']] 
# return IT employee names who also have a salary more than 60000

    name
3  David

In [19]:
employees.loc[(employees['department'] == 'IT') | (employees['department'] == 'HR'), ['name']] 
# return any employee name from IT or HR department

    name
0  Alice
1    Bob
3  David
4    Eve

___

## Joining DataFrames
| Method    | Primary Use Case | Default Behavior | Supports Index-Based Merge? | Supports Column-Based Merge? | Allows Multiple DataFrames? |
|-----------|-----------------|------------------|-----------------------------|-----------------------------|----------------------------|
| `merge()` | Merging DataFrames on one or more key columns | Joins on common column(s), default is `inner` join | ❌ No | ✅ Yes (`on=`) | ❌ No (only two DataFrames at a time) |
| `join()` | Merging on index values | Left join by default, matches on index | ✅ Yes (default behavior) | ❌ No (must set index first) | ❌ No (only two DataFrames at a time) |
| `concat()` | Stacking DataFrames vertically (`axis=0`) or horizontally (`axis=1`) | Preserves column/index names, default is row-wise (`axis=0`) | ✅ Yes (`axis=1` for columns) | ✅ Yes (`axis=0` for rows) | ✅ Yes (multiple DataFrames) |

### Merge
- .merge() allows flexible joins (inner, left, right, outer) between two dataframes based on column keys

In [26]:
merged_df = employees.merge(experience, on='id', how='inner')
display(merged_df)

   id     name  age  salary department  years_of_experience
0   1    Alice   25   50000         HR                    2
1   2      Bob   30   60000         IT                    5
2   3  Charlie   35   70000    Finance                    7
3   4    David   40   90000         IT                   10
4   5      Eve   22   45000         HR                    1

### Join
- .join() is index-based, meaning it merges on the row index, not column values.
- Equivalent to .merge() but quicker since it joins on indexes

In [20]:
joined_df = employees.join(experience, rsuffix='_exp') #Any repeat columns from the right table will be suffixed with _emp
display(joined_df)
# This only works because the index of both dataframes is the same

   id     name  age  salary department  id_exp  years_of_experience
0   1    Alice   25   50000         HR       1                    2
1   2      Bob   30   60000         IT       2                    5
2   3  Charlie   35   70000    Finance       3                    7
3   4    David   40   90000         IT       4                   10
4   5      Eve   22   45000         HR       5                    1

### Concat
- Used for combining DataFrames vertically (rows) or horizontally (columns).
- Works with multiple DataFrames.
- Default is row-wise (axis=0), but can also work column-wise (axis=1).

In [21]:
concat_df = pd.concat([employees, experience], axis=1)
# This will concatenate the two dataframes horizontally based on their index just like .join
display(concat_df)

   id     name  age  salary department  id  years_of_experience
0   1    Alice   25   50000         HR   1                    2
1   2      Bob   30   60000         IT   2                    5
2   3  Charlie   35   70000    Finance   3                    7
3   4    David   40   90000         IT   4                   10
4   5      Eve   22   45000         HR   5                    1

In [22]:
concat_df2 = pd.concat([employees, employees])
# This will concatenate the two dataframes vertically, stacking them on top of each other
display(concat_df2)

   id     name  age  salary department
0   1    Alice   25   50000         HR
1   2      Bob   30   60000         IT
2   3  Charlie   35   70000    Finance
3   4    David   40   90000         IT
4   5      Eve   22   45000         HR
0   1    Alice   25   50000         HR
1   2      Bob   30   60000         IT
2   3  Charlie   35   70000    Finance
3   4    David   40   90000         IT
4   5      Eve   22   45000         HR

In [25]:
concat_df3 = pd.concat([employees, experience])
# When trying to join two dataframes with different columns, the result will have NaN values for missing columns
# This is similar to a SQL outer join
display(concat_df3)

   id     name   age   salary department  years_of_experience
0   1    Alice  25.0  50000.0         HR                  NaN
1   2      Bob  30.0  60000.0         IT                  NaN
2   3  Charlie  35.0  70000.0    Finance                  NaN
3   4    David  40.0  90000.0         IT                  NaN
4   5      Eve  22.0  45000.0         HR                  NaN
0   1      NaN   NaN      NaN        NaN                  2.0
1   2      NaN   NaN      NaN        NaN                  5.0
2   3      NaN   NaN      NaN        NaN                  7.0
3   4      NaN   NaN      NaN        NaN                 10.0
4   5      NaN   NaN      NaN        NaN                  1.0

___

## Organizing Results

### Groupby

In [89]:
employees.groupby('department')[['salary']].mean()

             salary
department
Finance     70000.0
HR          47500.0
IT          70000.0

### Transform

In [31]:
employees['max_salary_in_department'] = employees.groupby('department')['salary'].transform('max')
print(employees.loc[employees['salary'] == employees['max_salary_in_department'], ['name', 'department', 'salary']])
# This will return the names of employees with the maximum salary in their respective departments

      name department  salary
0    Alice         HR   50000
2  Charlie    Finance   70000
3    David         IT   90000

### Idxmax

In [36]:
highest_paid_idx = employees.groupby('department')['salary'].idxmax()
highest_paid_employees = employees.loc[highest_paid_idx, ['name', 'department', 'salary']]
print(highest_paid_employees)

      name department  salary
2  Charlie    Finance   70000
0    Alice         HR   50000
3    David         IT   90000

### Sort Values

In [37]:
highest_paid_employees.sort_values(by='salary', ascending=False, inplace=True)
print(highest_paid_employees)

      name department  salary
3    David         IT   90000
2  Charlie    Finance   70000
0    Alice         HR   50000

___

## Pivoting and Reshaping

In [39]:
# Merge attendance with employees to include employee names
attendance_with_names = attendance.merge(employees, left_on='employee_id', right_on='id')

# Pivot the attendance data to show clock-in times for each employee on each date
pivoted_attendance_with_names = attendance_with_names.pivot(index='date', columns='name', values='clock_in_time')
display(pivoted_attendance_with_names)

name           Alice       Bob   Charlie     David       Eve
date
2025-03-11  09:22:00  08:01:00  08:50:00  08:35:00  09:18:00
2025-03-12  09:25:00  09:05:00  08:06:00  08:52:00  09:58:00
2025-03-13  08:22:00  09:04:00  08:02:00  08:34:00  09:32:00
2025-03-14  09:47:00  08:37:00  09:24:00  08:48:00  08:44:00
2025-03-17  09:46:00  08:23:00  08:04:00  08:19:00  08:06:00
2025-03-18  08:25:00  08:31:00  09:01:00  09:13:00  08:28:00
2025-03-19  09:31:00  09:52:00  09:27:00  08:39:00  09:46:00
2025-03-20  09:45:00  09:41:00  08:10:00  08:26:00  09:52:00
2025-03-21  09:16:00  08:38:00  09:08:00  09:42:00  09:19:00

In [42]:
# We can now melt the pivoted DataFrame to get it back into a long format
melted_attendance = pivoted_attendance_with_names.reset_index().melt(
    id_vars='date', 
    var_name='name', 
    value_name='clock_in_time'
)
display(melted_attendance.head())

         date   name clock_in_time
0  2025-03-11  Alice      09:22:00
1  2025-03-12  Alice      09:25:00
2  2025-03-13  Alice      08:22:00
3  2025-03-14  Alice      09:47:00
4  2025-03-17  Alice      09:46:00

___

## Complex Query Examples

___

## Other Common Operations

### Drop Duplicates

### Missing Data

### Regex

### Datetimes